apps/admin/models/AdminRole.php

SELECT * FROM `admin_auth` WHERE `parent`=''
---
    public static function getAllAuth($parent = '')
    {
        return AdminAuth::find()->where(['parent' => $parent])->all();