apps/admin/controllers/AdminController.php

SELECT * FROM `admin` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Admin::findOne($id)) !== null) {