apps/admin/controllers/AuthController.php

            }
        }

        AdminAuth::deleteAll(1);
---
DELETE FROM `admin_auth` WHERE 1

            if ($data['key'] == '*') {
                continue;
            }
            $model = AdminAuth::findOne($data['key']);
---
SELECT EXISTS(SELECT * FROM `admin_auth` WHERE `admin_auth`.`key`='admin')
SELECT * FROM `admin_auth` WHERE `key`='admin'