apps/admin/controllers/RoleController.php

    public function actionCreate()
    {
        $model = new AdminRole();

        if ($model->load(Yii::$app->request->post()) && $model->parseAuth() && $model->save()) {
---
INSERT INTO `admin_role` (`name`, `description`, `status`, `auth`, `route`) VALUES ('管理员', '', 9, '', '')

    protected function findModel($id)
    {
        if (($model = AdminRole::findOne($id)) !== null) {
---
SELECT * FROM `admin_role` WHERE `id`='1'