<?php

use yii\db\Migration;

class m171220_123732_menu extends Migration
{
    public function up()
    {

        $this->truncateTable('{{%menu}}');
        $this->execute("INSERT INTO `menu` (`id`, `parent_id`, `name`, `icon`, `child`, `parent_arr`, `child_arr`, `controller`, `action`, `params`, `auth_item`, `sort`, `status`) VALUES
(1, 0, '仪表盘', 'dashboard', 0, '0', '1', 'site', 'index', '', '', 0, 9),
(2, 0, '系统', 'cog', 1, '0', '2,7,8,9,15', '', '', '', '', 0, 9),
(3, 0, '店铺', 'suitcase', 1, '0', '3,10,11', '', '', '', '', 0, 9),
(4, 0, '商品', 'shopping-cart', 1, '0', '4,12,13,14', '', '', '', '', 0, 9),
(5, 0, '订单', 'list', 1, '0', '5,16,17,18', '', '', '', '', 0, 9),
(6, 0, '会员', 'users', 0, '0', '6', '', '', '', '', 0, 9),
(7, 2, '角色', '', 0, '0,2', '7', 'role', '', '', '', 0, 9),
(8, 2, '权限', '', 0, '0,2', '8', 'auth', '', '', '', 0, 9),
(9, 2, '管理员', '', 0, '0,2', '9', 'admin', '', '', '', 0, 9),
(10, 3, '店铺管理', '', 0, '0,3', '10', 'store', '', '', '', 0, 9),
(11, 3, '商品分类', '', 0, '0,3', '11', 'store-category', '', '', '', 0, 9),
(12, 4, '商品管理', '', 0, '0,4', '12', 'goods', '', '', '', 0, 9),
(13, 4, '商品分类', '', 0, '0,4', '13', 'category', '', '', '', 0, 9),
(14, 4, '运费模板', '', 0, '0,4', '14', 'freight', '', '', '', 0, 9),
(15, 2, '广告管理', '', 0, '0,2', '15', 'ad', '', '', '', 0, 9),
(16, 5, '订单管理', '', 0, '0,5', '16', 'order', 'index', '', '', 0, 9),
(17, 5, '发货管理', '', 0, '0,5', '17', 'order', 'delivery', '', '', 0, 9),
(18, 5, '退款管理', '', 0, '0,5', '18', 'order', 'refund', '', '', 0, 9);");
    }

    public function down()
    {
    }
}
