apps/admin/views/role/_form.php

                <tbody>
                <?php $inputName = Html::getInputName($model, 'auth'); ?>
                <input type="hidden" name="<?= $inputName ?>" value="" />
                <?php $auths = \admin\models\AdminAuth::find()->where(['parent' => ''])->all(); ?>
---
SELECT * FROM `admin_auth` WHERE `parent`=''